 <?php
return array(
	//'配置项'=>'配置值'
    'APP_GROUP_LIST'            => 'Home,Admin',//分组
    'DEFAULT_GROUP'             =>'Home',//默认分组
    'DEFAULT_THEME'             =>'default',//使用的模板
	'TMPL_DETECT_THEME'         => true, // 自动侦测模板主题
	'LANG_SWITCH_ON'	        => true,//开启语言包
    'URL_MODEL'                 => 2, // 如果你的环境不支持PATHINFO 请设置为3,设置为2时配合放在项目入口文件一起的rewrite规则实现省略index.php/
	'URL_CASE_INSENSITIVE'      => true,//关闭大小写为true.忽略地址大小写
    'TMPL_CACHE_ON'             => true, // 是否开启模板编译缓存,设为false则每次都会重新编译
    'TMPL_STRIP_SPACE'          => false,  // 是否去除模板文件里面的html空格与换行
    'REQUEST_VARS_FILTER'	    => true,	//参数安全过滤
    
	'APP_ROOT'                  => str_replace(array('\\','Conf','config.php','//'), array('/','/','','/'), dirname(__FILE__)),//APP目录物理路径
	'WEB_ROOT'                  => str_replace("\\", '/', substr(str_replace('\\Conf\\', '/', dirname(__FILE__)),0,-8)),//网站根目录物理路径
	'WEB_URL'                   => "http://".$_SERVER['HTTP_HOST'],
	//网站域名
	'CUR_URI'                   => $_SERVER['REQUEST_URI'],//当前地址
	'URL_HTML_SUFFIX'           => ".html",//静态文件后缀
	'TMPL_ACTION_ERROR'         => str_replace("\\", '/', substr(str_replace('\\Conf\\', '/', dirname(__FILE__)),0,-8))."/Style/tip/tip.html",//操作错误提示
	'TMPL_ACTION_SUCCESS'       => str_replace("\\", '/', substr(str_replace('\\Conf\\', '/', dirname(__FILE__)),0,-8))."/Style/tip/tip.html",//操作正确提示
	'ERROR_PAGE'	            => '/Public/error.html',
	'LOAD_EXT_CONFIG'           => 'crons',//加载扩展配置文件
	'DB_PATH'                   => '/UF/data',
    'NARROW_PATH'               => './UF/Uploads/Mem/',//缩略图路径
    'MEM_PATH'                  => '/UF/Uploads/Mem/',//身份证上传路径
    'Face_PIC_PATH'             => '/UF/Uploads/Face/',//Face++图片
    'OFF'                       => 1, // checkRequestSig认证 0、跳过认证 1 不跳过 
    //数据库配置
    //开发环境
    'DB_TYPE'           => 'mysql',
    'DB_HOST'           => '192.168.10.115',
    'DB_NAME'           => 'cash_test',
    'DB_USER'           => 'cashtest', 
    'DB_PWD'            => '123456',
    'DB_PORT'           => '3306',
    'DB_PREFIX'         => 'ml_',
    
    //数据库配置（风控）
    'DB_TYPE_RISK'      => 'mysql',
    'DB_HOST_RISK'      => '192.168.10.115',
    'DB_NAME_RISK'      => 'risk_test',
    'DB_USER_RISK'      => 'risktest',
    'DB_PWD_RISK'       => '123456',
    'DB_PORT_RISK'      => '3306',
    'DB_PREFIX_RISK'    => 'rs_',

    //测试环境
    /*'DB_TYPE'           => 'mysql',
    'DB_HOST'           => 'localhost',
    'DB_NAME'           => 'cash_test',
    'DB_USER'           => 'root',
    'DB_PWD'            => '123456',
    'DB_PORT'           => '3306',
    'DB_PREFIX'         => 'ml_',
    
    //数据库配置（风控）
    'DB_TYPE_RISK'      => 'mysql',
    'DB_HOST_RISK'      => 'localhost',
    'DB_NAME_RISK'      => 'risk_test',
    'DB_USER_RISK'      => 'root',
    'DB_PWD_RISK'       => '123456',
    'DB_PORT_RISK'      => '3306',
    'DB_PREFIX_RISK'    => 'rs_',*/
    
    //数据库配置（福米金额）
    'DB_TYPE_SINA'      => 'mysql',
    'DB_HOST_SINA'      => '120.26.208.3',
    'DB_NAME_SINA'      => 'test_fumi',
    'DB_USER_SINA'      => 'testfumi',
    'DB_PWD_SINA'       => 'testfumi',
    'DB_PORT_SINA'      => '3306',
    'DB_PREFIX_SINA'    => 'lzh_',
    
    
	//子域名配置
	'URL_ROUTER_ON'		=>true,//开启路由规则
	'URL_ROUTE_RULES'	=>array(
	    '/^baiqishiId\/(\d+).html$/'       => 'Home/baiqishiId/index?id=:1',//白骑士回调页面
        '/^baiqishiId\/(\d+).html\?(.*)$/' => 'Home/baiqishiId/index?id=:1:2',//白骑士回调页面
	),

	'SYS_URL'	=>array('admin','baiqishiId'),
    
    'WEIXIN'         =>array(
        'app_id'     => 'wxfc602b56985bfbc6',
        'app_secret' => '6d67acb7b7b461834dda6e08471429a3',
        'return_url' => 'http://www.cashmall.com.cn/'
    ),
    
    'BID_WEB'              => 'http://192.168.10.121:8011',//福米上标URL
    'WEBSITE_URL'          => 'http://fumitest.hicp.net/',//接口调用
    'AUTH_ALIPAY_URL'      => 'alipay://fumitest.hicp.net',//人脸识别芝麻回调
    'RISK_WEB'             => 'http://192.168.10.115:8280',//请求风控系统WEB
    'RISK_URL'             => 'http://192.168.10.115:8280/decisionTree/runDec',//请求风控系统的决策树URL
    'OPERATOR_LM_URL'      => 'http://192.168.10.115:8280/lmzx/submit',//初始请求运行商立木的URL
    'OPERATOR_LM_IN_URL'   => 'http://192.168.10.115:8280/lmzx/input',//提交运行商立木的验证码URL
    'OPERATOR_MH_URL'      => 'http://192.168.10.115:8280/sjmh/submit',//初始请求运行商魔盒的URL
    'OPERATOR_MH_IN_URL'   => 'http://192.168.10.115:8280/sjmh/input',//提交运行商魔盒的验证码
    'ZHIMA_URL'            => 'http://192.168.10.115:8280/zm/creScore',//查询芝麻分数接口
    
    'REPAYMENTTYPE' => array(
        1   =>'天',
        2   =>'周',
        3   =>'月',
        4   =>'季度',
        5   =>'年',
     ),
    
    //借款用途
    'CASHLOANS_USE' => array(
        1   =>'交房租',
        2   =>'购买个人消费品',
        3   =>'出游',
        4   =>'培训费',
        5   =>'医疗美容',
    ),
    
    //学历
    'EDUCATION_NAME' => array(
        1   =>'高中以下',
        2   =>'高中／中专',
        3   =>'大专',
        4   =>'本科',
        5   =>'研究生',
    ),
    
    //学历code
    'EDUCATION_CODE' => array(
        1   =>'PRE_HIGH_SCHOOL',
        2   =>'HIGH_SCHOOL',
        3   =>'JUNIOR_COLLEGE',
        4   =>'UNDER_GRADUATE',
        5   =>'POST_GRADUATE',
    ),
    
    //婚姻状况
    'MARRIAGE_NAME' => array(
        1   =>'未婚',
        2   =>'已婚',
        3   =>'离异',
        4   =>'丧偶',
        5   =>'再婚',
        6   =>'复婚',
    ),
    
    //婚姻状况code
    'MARRIAGE_CODE' => array(
        1   =>'SPINSTERHOOD',
        2   =>'MARRIED',
        3   =>'DIVORCED',
        4   =>'WIDOWED',
        5   =>'REMARRY',
        6   =>'REMARRY_FORMER',
        
    ),    

    'KIDS' => array(
        1   =>'无',
        2   =>'1个',
        3   =>'2个',
        4   =>'3个',
    ),
    
    //社会关系
    'SOCIAL_NAME' => array(
        1    =>'父亲',
        2    =>'母亲',
        3    =>'配偶',
        4    =>'子女',
        5    =>'其他亲属',
        6    =>'朋友',
        7    =>'同事',
        8    =>'其他',
    ),
    
    //社会关系code
    'SOCIAL_CODE' => array(
        1    =>'father',
        2    =>'mother',
        3    =>'spouse',	
        4    =>'child',
        5    =>'other_relative',
        6    =>'friend',
        7    =>'coworker',
        8    =>'others',
    ),
    
    //职称
    'POSITION_NAME' => array(
        1       =>'高级资深人员',
        2       =>'中级技术人员',
        3       =>'初级、助理人员',
        4       =>'见习专员',
        5       =>'高层管理人员',
        6       =>'中层管理人员',
        7       =>'基层管理人员',
        8       =>'普通员工',
    ),
    
    //职称code
    'POSITION_CODE' => array(
        1       =>'ADVANCED',
        2       =>'INTERMEDIATES',
        3       =>'BEGINNERS',
        4       =>'PRACTICE',
        5       =>'SENIOR',
        6       =>'MIDDLE',
        7       =>'JUNIOR',
        8       =>'NORMAL',
    ),
    
    //职位
    'CAREER_NAME' => array(
        '政府官员、公务员'               =>'政府官员、公务员',
        '专业人员'                      =>'专业人员',
        '企业高中级主管'                 =>'企业高中级主管',
        '军官'                          =>'军官',
        '企业负责人、股东'                =>'企业负责人、股东',
        '企业基层主管、半专业人员'         =>'企业基层主管、半专业人员',
        '警察，消防员'                   =>'警察，消防员',
        '操作人员'                       =>'操作人员',
        '现役军人'                       =>'现役军人',
        '技能工作、文艺工作者'            =>'技能工作、文艺工作者',
        '个体商店老板'                   =>'个体商店老板',
        '一般工人'                       =>'一般工人',
        '业务人员'                       =>'业务人员',
        '收货人员'                       =>'收货人员',
        '无技术工人'                     =>'无技术工人',
        '保安、司机、服务、外送人员'       =>'保安、司机、服务、外送人员',
        '农林牧渔'                       =>'农林牧渔',
        '清洁人员'                       =>'清洁人员',
        '摊贩'                          =>'摊贩',
        '实习生'                        =>'实习生',
        '退休'                          =>'退休',
        '家庭主妇'                      =>'家庭主妇',
        '学生'                          =>'学生',
        '失业'                          =>'失业',
    ),
    
    'CAREER_NAME_LIST' => array(
        1         =>'专业人员',
        2         =>'操作人员',
        3         =>'业务人员',
        4         =>'一般工人',
        5         =>'收货人员',
        6         =>'无技术工人',
        7         =>'保安、司机、服务、外送人员',
        8         =>'清洁人员',
        9         =>'技能工作、文艺工作者',
        10        =>'企业基层主管、半专业人员',
        11        =>'家庭主妇',
        12        =>'学生',
        13        =>'实习生',
        14        =>'退休',
        15        =>'失业',
        16        =>'摊贩',
        17        =>'农林牧渔',
        18        =>'个体商店老板',
        19        =>'企业高中级主管',
        20        =>'企业负责人、股东',
        21        =>'军官',
        22        =>'现役军人',
        23        =>'警察，消防员',
        24        =>'政府官员、公务员',
    ),
    
    //公司性质
    'CAREER_NAME' => array(
        '机关事业'    =>'机关事业',
        '国有股份'    =>'国有股份',
        '合资'        =>'合资',
        '私营'       =>'私营',
        '个体'       =>'个体',
        ' 其他'      =>'其他',
    ),
    
    //月收入
	'MONTHLY_INCOME' =>array(
	    1    =>'小于1000元',
	    2    =>'1000-2000元',
	    3    =>'2000-4000元',
	    4    =>'4000-6000元',
	    5    =>'6000-10000元',
	    6    =>'10000元以上',
	),
    
    //年收入
    'YEAR_INCOME' =>array(
        '10000以下'       =>'10000以下',
        '10000-50000'    =>'10000-50000',
        '50000-100000'   =>'50000-100000',
        '100000-200000'  =>'100000-200000',
        '200000以上'      =>'200000以上',
    ),
    
    //公司行业
    'COMPANY_INDUSTRY' =>array(
        '农、林、牧、渔业；采掘业'            =>'农、林、牧、渔业；采掘业',
        '制造业'                            =>'制造业',
        '电力、仓储和邮政业'                 =>'电力、仓储和邮政业',
        '信息传输、计算机服务和软件业'        =>'信息传输、计算机服务和软件业',
        '批发和零售业'                      =>'批发和零售业',
        '住宿和餐饮业'                      =>'住宿和餐饮业',
        '金融业'                           =>'金融业',
        '房地产业'                         =>'房地产业',
        '租赁和商务服务业'                  =>'租赁和商务服务业',
        '科学研究、技术服务业和地质勘察业'    =>'科学研究、技术服务业和地质勘察业',
        '水利、环境和公共设施管理业'         =>'水利、环境和公共设施管理业',
        '居民服务和其他服务业'              =>'居民服务和其他服务业',
        '教育'                            =>'教育',
        '卫生、社会保障和社会福利业'         =>'卫生、社会保障和社会福利业',
        '文化、体育和娱乐业'                =>'文化、体育和娱乐业',
        '公共管理和社会组织'                =>'公共管理和社会组织',
        '国际组织'                         =>'国际组织',
        '未知'                             =>'未知',
    ),
    
    //房产情况
    'HOUSE' => array(
        '无房'        =>'无房',
        '有房有贷款'   =>'有房有贷款',
        '有房无贷款'   =>'有房无贷款',
        '其他'        =>'其他',
    ),
    
    //房产类型
    'HOUSE_TYPE' => array(
        '商品房'        =>'商品房',
        '经济适用房'   =>'经济适用房',
        '商住两用房'   =>'商住两用房',
        '回迁房'        =>'回迁房',
        '拆迁房'        =>'拆迁房',
        '自建房'        =>'自建房',
        '宅基地'        =>'宅基地',
        '临建房'        =>'临建房',
        '期房'          =>'期房',
        '预售房'        =>'预售房',
        '其他'         =>'其他',
    ),
    
    //工作时间
    'WORK_TIME' => array(
        '1年以下'         =>'1年以下',
        '1年'           =>'1年',
        '2年'           =>'2年',
        '3-4年'         =>'3-4年',
        '5-7年'         =>'5-7年',
        '8-9年'         =>'8-9年',
        '10年以上'       =>'10年以上',
    ),
    
    //负债情况
    'DEBT_LIST' => array(
        '5000以下'       => '5000以下',
        '5000-1万'       => '5000-1万',
        '1万-5万'        => '1万-5万',
        '5万-10万'       => '5万-10万',
        '10万-50万'      => '10万-50万',
        '50万-100万'     => '50万-100万',
        '100万以上'      => '100万以上',
    ),
    
    //新浪支付支持的银行
    /*'SINA_BANK_NAME' => array(
        1           => '招商银行',
        2           => '中国银行',
        3           => '中国工商银行',
        4           => '中国建设银行',
        5           => '中国农业银行',
        6           => '中国邮政储蓄银行',
        7           => '交通银行',
        8           => '上海浦东发展银行',
        9           => '深圳发展银行',
        10          => '中国民生银行',
        11          => '兴业银行',
        12          => '平安银行',
        13          => '北京银行',
        14          => '天津银行',
        15          => '上海银行',
        16          => '华夏银行',
        17          => '光大银行',
        18          => '广发银行',
        19          => '中信银行',
        20          => '上海农商银行',
    ),*/
    
    'SINA_BANK_NAME' => array(
        1           => '中国银行',
        2           => '中国工商银行',
        3           => '中国建设银行',
        4           => '中国农业银行',
        5           => '中国邮政储蓄银行',
        6           => '交通银行',
        7           => '上海浦东发展银行',
        8           => '中国民生银行',
        9           => '兴业银行',
        10          => '平安银行',
        11          => '上海银行',
        12          => '光大银行',
        13          => '广发银行',
    ),
    
    //新浪支付支持的银行code
    /*'SINA_BANK_CODE' => array(
        'CMB'               => '招商银行',
        'BOC'               => '中国银行',
        'ICBC'              => '中国工商银行',
        'CCB'               => '中国建设银行',
        'ABC'               => '中国农业银行',
        'PSBC'              => '中国邮政储蓄银行',
        'SPDB'              => '上海浦东发展银行',
        'CMBC'              => '中国民生银行',
        'CIB'               => '兴业银行',
        'SZPAB'             => '平安银行',
        'BCCB'              => '北京银行',
        'BOS'               => '上海银行',
        'HXB'               => '华夏银行',
        'CEB'               => '光大银行',
        'GDB'               => '广发银行',
        'CITIC'             => '中信银行',
        'SHRCB'             => '上海农商银行',
    ),*/
    
    'SINA_BANK_CODE' => array(
        'BOC'               => '中国银行',
        'ICBC'              => '中国工商银行',
        'CCB'               => '中国建设银行',
        'ABC'               => '中国农业银行',
        'PSBC'              => '中国邮政储蓄银行',
        'BCM'               => '交通银行',
        'SPDB'              => '上海浦东发展银行',
        'CMBC'              => '中国民生银行',
        'CIB'               => '兴业银行',
        'SZPAB'             => '平安银行',
        'BOS'               => '上海银行',
        'CEB'               => '光大银行',
        'GDB'               => '广发银行',
    ),
    
    'BANK_CODE' => array(
        1   =>'0801020000',
        2   =>'0801030000',
        3   =>'0801040000',
        4   =>'0801050000',
        5   =>'0801000000',
        6   =>'0804100000',
        7   =>'0803050000',
        8   =>'0803030000',
        9   =>'0803060000',
        10  =>'0803020000',
        11  =>'0803090000',
        12  =>'0803040000',
        13  =>'0803080000',
        14  =>'0803100000',
        15  =>'0803010000',
    ),
    
    'BANK_LIST' => array(
        1    => '工商银行',
        2    => '农业银行',
        3    => '中国银行',
        4    => '建设银行',
        5    => '邮政储蓄银行',
        6    => '平安银行',
        7    => '民生银行',
        8    => '光大银行',
        9    => '广发银行',
        10   => '中信银行',
        11   => '兴业银行',
        12   => '华夏银行',
        13   => '招商银行',
        14   => '浦发银行',
        15   => '交通银行',
    ),
    
    'BORROW_STATUS' => array(
        0  => "已提交申请",
        1  => "已提交待审核",
        2  => "已审核通过待签约",
        3  => "已签约待放款",
        4  => "已放款待还款",
        5  => "已还款",
        93 => "身份验证失败",
        94 => "复审失败",
        95 => "审核拒绝",
        96 => "放款拒绝",
        97 => "签约拒绝",
        98 => "初审拒绝",
        99 => "取消"
    ),
    
    'EVENT_LIST' => array(
        1    => '注册',
        2    => '登录',
        3    => '注销',
        4    => '选择借款产品到达',
        5    => '选择借款产品提交',
        6    => '基本信息到达',
        7    => '基本信息提交',
        8    => '详细信息到达',
        9    => '详细信息提交',
        10   => '手机认证到达',
        11   => '手机认证提交',
        12   => '绑定银行卡到达',
        13   => '绑定银行卡提交',
        14   => '芝麻授权',
        15   => '人脸识别',
        16   => '提交签约到达',
        17   => '提交签约离开',
        18   => '提交放款申请',
        19   => '正常还款提交',
        20   => '逾期还款提交',
        21   => '续期提交',
        22   => '费用说明',
        23   => '优惠劵',
        24   => '网络服务与征信授权条款 ',
        25   => '借款协议',
        26   => '更换银行卡',
        27   => '综合费用',
        28   => '绑定银行卡',
        29   => '查询IP',
     ),
    
    'EVENT_AD_LIST' => array(
        1    => 'QQ修改次数',
        2    => '邮箱修改次数',
        3    => '常住地址修改次数',
        4    => '年收入修改次数',
        5    => '公司详细地址修改次数',
        6    => '家庭成员修改次数',
        7    => '家庭成员手机号修改次数',
        8    => '同事姓名修改次数',
        9    => '同事手机号修改次数',
        10   => '朋友姓名修改次数',
        11   => '朋友手机号修改次数',
    ),
    
     'WECHAT_SCENE' => array(
        1   => '审核进度提醒',
        2   => '初审失败通知',
        3   => '审核通过通知',
        4   => '贷款取消通知',
        5   => '交易提醒',
        6   => '还款提醒B1',
        7   => '还款提醒B0',
        8   => '交易提醒',
        9   => '还款失败提醒',
        10  => '借款逾期提醒M1',
        11  => '借款逾期提醒M7',
        12  => '续期提醒',
        13  => '自动扣款失败提醒',
        14  => '管理员不通过通知',
        15  => '认证结果通知',
        16  => '认证审核通知',
        17  => '用户申请认证成功',
        18  => '用户申请认证失败',
        19  => '人脸识别失败通知',
        20  => '决策树失败通知',
        21  => '复审通过通知',
        22  => '复审或人脸失败通知',
        23  => '授信支付成功',
        24  => '还款成功',
        25  => '签约后提醒授信B1',
        26  => '签约后提醒授信B2',
    ),
    
    'REPAYMENT_METHODS' => array(
        1   => '支付宝',
        2   => '微信',
        3   => '其他',
    ),
);
?>